app/Http/Controllers/Review/ReviewController.php

    public function handleAddComment(ReviewRequest $request, $product_id)
    {
        $data = [
            'comment' => $request->comment,
            'product_id' => $product_id,
            'user_id' => Auth::user()->id
        ];

        // dd($data);
        if (Review::query()->create($data)) {
---
insert into `reviews` (`comment`, `product_id`, `user_id`, `updated_at`, `created_at`) values ('f', '5', 21, '2024-11-07 07:57:53', '2024-11-07 07:57:53')

    public function handleDestroyComment($product_id)
    {
        $review = Review::where('product_id', $product_id)->where('user_id', Auth::id())->first();
        // dd($review);
        if ($review) {
            $review->delete();
---
select * from `reviews` where `product_id` = '5' and `user_id` = 21 limit 1
delete from `reviews` where `id` = 9