app/Http/Controllers/Client/Product/ProductController.php

    public function index()
    {
        $products = Product::query()->where('is_active', '1')
            ->with(['productVariants', 'category', 'brand'])
            ->orderBy('name', 'asc')->limit(9)->get();

        $categories = Category::query()->with('products')->get();

        $brands = Brand::query()->where('status', '1')->get();

        $listLatestProduct = Product::query()->latest('id')->limit(12)->get();

        $banners = Banner::query()->where('status', '1')
            ->orderBy('name', 'asc')->get();
---
select * from `categories` where `categories`.`id` in (9)
select * from `product_variants` where `product_variants`.`product_id` in (5)
select * from `product_variants` where `product_variants`.`product_id` in (5, 8, 11, 14)
select * from `products` where `category_id` = 9 and `id` <> '3' limit 4
select * from `product_variants` where `product_variants`.`product_id` in (3, 8, 11, 14)