app/Services/OrderAdmin/OrderFormServices.php

select `id`, `name`, `price_regular`, `price_sale` from `products`
select `name`, `id` from `product_sizes`
select `name`, `id` from `product_colors`
select `name`, `id` from `users`
select `name`, `id` from `roles`
---
    public function handleFormCreate()
    {
        return [
            'products'      => Product::query()->select('id', 'name', 'price_regular', 'price_sale')->get(),
            'sizes'         => ProductSize::query()->pluck('name', 'id')->all(),
            'colors'        => ProductColor::query()->pluck('name', 'id')->all(),
            'users'         => User::query()->pluck('name', 'id')->all(),
            'roles'         => Role::query()->pluck('name', 'id')->all(),
            'statusOrder'   => Order::STATUS_ORDER,
        ];