app/Http/Controllers/Client/CartController.php

    public function add(Request $request)
    {

        $product = Product::query()->findOrFail(\request('product_id'));

        $productVariant = ProductVariant::query()
            ->with(['color', 'size'])
            ->where([
                'product_id' => \request('product_id'),
                'product_size_id' => \request('product_size'),
                'product_color_id' => \request('product_color'),
            ])
            ->firstOrFail();
---
select * from `products` where `products`.`id` = '5' limit 1
select * from `product_variants` where (`product_id` = '5' and `product_size_id` = '4' and `product_color_id` = '3') limit 1