app/Http/Controllers/Client/ProductController.php

    public function productDetail($slug)
    {
        $product = Product::query()->with(['productVariants', 'category', 'galleries'])->where('slug', $slug)->first();


        // Kiểm tra sản phẩm có tồn tại hay không
        if (!$product) {
            abort(404);
        }
        // Lấy 4 hình ảnh của sản phẩm galleries
        $productGalleries =  $product->galleries()->limit(4)->get();

        // Lấy danh sách màu sắc và kích thước
        $colors = ProductColor::query()->pluck('name', 'id')->all();
        $sizes = ProductSize::query()->pluck('name', 'id')->all();

        // Lấy các bình luận cho sản phẩm
        $comments = Review::with('user')->where('product_id', $product->id)
        ->where('is_show', 0)
        ->orderBy('id', 'DESC')->get();

        // Lấy các sản phẩm liên quan dựa trên danh mục của sản phẩm hiện tại
        $relatedProducts = Product::with(['galleries', 'productVariants'])->where('category_id', $product->category_id)->where('id', '<>', $product->id)->limit(4)->get();
---
select * from `categories` where `categories`.`id` in (9)
select * from `product_variants` where `product_variants`.`product_id` in (5)
select * from `products` where `slug` = 'optio-dolorem-itaque-temporibus-et-quod-aut-ut-similique-omnis-non-ex-2M0QtIjo' limit 1
select `name`, `id` from `product_colors`
select `name`, `id` from `product_sizes`
select * from `reviews` where `product_id` = 5 and `is_show` = 0 order by `id` desc
select * from `users` where `users`.`id` in (2, 21)
select * from `product_variants` where `product_variants`.`product_id` in (3, 8, 11, 14)
select * from `products` where `category_id` = 9 and `id` <> 5 limit 4