app/Http/Controllers/Client/ReviewController.php

select * from `reviews` where `reviews`.`id` = '12' limit 1
delete from `reviews` where `id` = 12
---
    public function handleDestroyComment($comment_id)
    {
        $review = Review::query()->findOrFail($comment_id);
        $review->delete();