app/Http/Controllers/Client/Cart/CartController.php

select * from `products` where `products`.`id` = '3' limit 1
---
    public function add(Request $request, Cart $cart)
    {
        $product = Product::find($request->id);