app/Http/Controllers/Admin/OrderController.php

    public function index()
    {
        $data = Order::query()->with(['user', 'role'])->latest('id')->paginate(10);
---
select * from `orders`
select * from `roles` where `roles`.`id` in (1, 3)
select * from `users` where `users`.`id` in (2, 11, 16, 17, 19)