app/Http/Controllers/Admin/RefundController.php

select * from `orders` where `orders`.`id` in (37)
select * from `refunds` order by `id` desc
select * from `users` where `users`.`id` in (2)
select * from `orders`
select * from `users`
---
    public function index()
    {
        $data = Refund::query()->with(['user', 'order'])->latest('id')->get();

        $status = Refund::STATUS;

        $orders = Order::query()->get();

        $users = User::query()->get();