app/Http/Controllers/Admin/ReviewController.php

    public function index()
    {
        $reviews = Review::query()->with(['user', 'product'])->get();
---
select * from `products` where `products`.`id` in (1, 5)
select * from `reviews`
select * from `users` where `users`.`id` in (2, 7)

    public function show($id)
    {
        $review = Review::query()->findOrFail($id);
---
select * from `reviews` where `reviews`.`id` = '2' limit 1